text/chart_style/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>チャート式Ruby</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">チャート式Ruby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc29710f">1. 概要</a></li>
<li><a href="#org4ac3352">2. chart式の体裁と内容</a></li>
<li><a href="#orgbff5a2c">3. class導入の手順</a></li>
<li><a href="#org46bb108">4. 学生の作業</a>
<ul>
<li><a href="#org00b7f83">4.1. 文書作成</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc29710f" class="outline-2">
<h2 id="orgc29710f"><span class="section-number-2">1</span> 概要</h2>
<div class="outline-text-2" id="text-1">
<p>
rubyの初心者向け教科書があまりに中途半端なので，自分で書くことにしました．
これは，ruby = TDD + English という図式が自分の中で出来上がって，
でも，それをうまく学生に伝えることができないので，なんとかしたいからです．
</p>

<p>
学生の変容が怖いです．プログラミングをやる前は，ほとんどの学生が一年程度で
身につくと思っているのに，4年後の生態を見るとほとんどが答えのcopy &amp; pasteです．
そして，programmingがいやになって去って行く学生が多くいます．
</p>

<p>
ところが，突然変異的にできる学生がいます．
彼らは，教えなくてもできるようです．
何が違うのだろう．．．
最初から違うのではないかというのが，私の感想です．
</p>

<p>
数学の問題を解くときに試行錯誤しなさいと言いますが，
その試行錯誤のやり方を本当に教えているのだろうかという点です．
解答を丸写しする学生は，動作が理解できません．
理解するために，解答を分解して打ち込んで行くことが
できないのでしょうね．
</p>

<p>
プログラミング言語を学ぶというのではなく，
文章を考えるようにcodingして行くというのが，
chart式rubyの目標です．
</p>
</div>
</div>

<div id="outline-container-org4ac3352" class="outline-2">
<h2 id="org4ac3352"><span class="section-number-2">2</span> chart式の体裁と内容</h2>
<div class="outline-text-2" id="text-2">
<p>
chart式と言った時，
「たくさんの問題をずらずら解いて行くこと」
と思っている研究者がいて驚きました．
chart式の本質はそこではなく，
</p>
<ol class="org-ol">
<li>簡単な解説</li>
<li>詳しい解法</li>
<li>類題での確認</li>
</ol>
<p>
です．この基本に沿って
</p>

<ol class="org-ol">
<li><a href="./c1_puts.html">c1_puts.org</a> 出力のみ,先ずはhello worldでしょ</li>
<li><a href="./c2_name_method_hello.html">c2_name_method_hello.org</a> method, Kent Beckの至言がある</li>
<li><a href="./c3_if_case_leap_year.html">c3_if_case_leap_year.org</a> TDDでcaseまで</li>
<li><a href="./c4_assert_equal.html">c4_assert_equal.org</a> gem, colorizeの継承, require, 重複実行の予防</li>
<li><a href="././c5_fibonacci.html">c5_fibonacci.org</a> recursion(再帰)をtestで</li>
<li><a href="././c6_roman_numerals.html">c6_roman_numerals.org</a> 仕上げ問題</li>
</ol>
<p>
なんかでしょうか．そしてclassへ行く．
</p>
</div>
</div>

<div id="outline-container-orgbff5a2c" class="outline-2">
<h2 id="orgbff5a2c"><span class="section-number-2">3</span> class導入の手順</h2>
<div class="outline-text-2" id="text-3">
<p>
えっと，てっぺんのorgではclass導入は別立てになっていますが，
初心者には納得してもらうためにここまで進んだ人にテキストを提供しましょう．
</p>

<ul class="org-ul">
<li>fibonacciのclass化，Integerのover ride</li>
<li>roman numeralsのintegerのover write</li>
<li>initialize</li>
<li>self, methods</li>
<li>attr_accessor</li>
</ul>
</div>
</div>

<div id="outline-container-org46bb108" class="outline-2">
<h2 id="org46bb108"><span class="section-number-2">4</span> 学生の作業</h2>
<div class="outline-text-2" id="text-4">
<p>
学生が類題を独自に解いたかどうかをどうやって判定するかが問題になります．
</p>
<ul class="org-ul">
<li>tddのred状態を残す</li>
<li>green状態を残す</li>
<li>refactoringを晒す</li>
</ul>
<p>
というのが一つの解になるのではと期待しています．
まさに，gitのlog状態．．．うーーーん．そこを残すのは．．．
</p>
</div>

<div id="outline-container-org00b7f83" class="outline-3">
<h3 id="org00b7f83"><span class="section-number-3">4.1</span> 文書作成</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>学習者自らが文書を作成するというのをやってみてください．</li>
<li>自分の書いたcodeを表示させるというやり方です．</li>
<li>卒論を仕上げるのと同じようにして，文書を書くという作業を通じて，codeを覚えていくというものです．</li>
<li>platexと違って，html outはどんな環境でもできるのでそいつを使います．</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
